//Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

/*
Console.Write("Введите число: ");
string num = Console.ReadLine();

void CheckNumber(string num)

{
  if (num[0]==num[4] || num[1]==num[3]){
    Console.WriteLine($"Ваше число: {num} - палиндром.");
  }
  else Console.WriteLine($"Ваше число: {num} - не палиндром.");
}

if (num.Length == 5)

{
  CheckNumber(num);
}
else Console.WriteLine($"Введи правильное число");
*/

// Задача 21 Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.